Eloise-wang/BLE_DataCollection_New/ZKFJ_BLE_wireless_uart_freertos/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_PS_ps0 0x00u /*!<@brief Pull Select: Enables internal pulldown resistor */
#define PCR_PS_ps1 0x01u /*!<@brief Pull Select: Enables internal pullup resistor */

/*! @name PORTA21 (number 18), pressure Detection
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_pressure_Detection_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_pressure_Detection_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_pressure_Detection_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                          /* @} */

/*! @name PORTA20 (number 17), temp Detection
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_temp_Detection_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_temp_Detection_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_temp_Detection_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PORTC6 (number 44), Battery Detection
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_Battery_Detection_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_Battery_Detection_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_Battery_Detection_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*! @name PORTC7 (number 45), Electricity_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINBUTTON0_Electricity_LED_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINBUTTON0_Electricity_LED_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_Electricity_LED_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_Electricity_LED_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_Electricity_LED_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PORTA18 (number 13), Send_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINBUTTON0_Send_LED_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINBUTTON0_Send_LED_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_Send_LED_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_Send_LED_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_Send_LED_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORTA19 (number 14), Collection_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINBUTTON0_Collection_LED_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINBUTTON0_Collection_LED_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_Collection_LED_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_Collection_LED_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_Collection_LED_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PORTD2 (number 25), BLE_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINBUTTON0_BLE_LED_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINBUTTON0_BLE_LED_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_BLE_LED_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_BLE_LED_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_BLE_LED_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinButton0(void);

/*! @name PORTC6 (number 44), Battery Detection
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINBUTTON1_SW3_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINBUTTON1_SW3_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON1_SW3_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON1_SW3_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON1_SW3_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinButton1(void);

/*!
 * @brief Configures pin routing to route SWO to GPIO (only one pin alternate (alt5) is available for SWO on KW45)
 *
 */
void BOARD_InitPinSWO(void);

/*! @name PORTB0 (number 46), LED1/LPSPI1_PCS0
  @{ */

