Eloise-wang/BLE_DataCollection_New/ZKFJ_BLE_wireless_uart_freertos/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINLED1_LED1_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINLED1_LED1_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINLED1_LED1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINLED1_LED1_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINLED1_LED1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinLED1(void);

/*! @name PORTA21 (number 18), pressure Detection
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINLED2_LED_R_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINLED2_LED_R_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINLED2_LED_R_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINLED2_LED_R_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINLED2_LED_R_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinLED2(void);

/*! @name PORTA19 (number 14), Collection_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINLED3_LED_G_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINLED3_LED_G_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINLED3_LED_G_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINLED3_LED_G_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINLED3_LED_G_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinLED3(void);

/*! @name PORTA20 (number 17), temp Detection
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINLED4_LED_B_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINLED4_LED_B_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINLED4_LED_B_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINLED4_LED_B_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINLED4_LED_B_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinLED4(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinLPUART0_RX(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinLPUART0_TX(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinLPUART1_RX(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinLPUART1_TX(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinLPUART0_RX(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinLPUART0_TX(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinLPUART1_RX(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinLPUART1_TX(void);

/*! @name PORTC6 (number 44), Battery Detection
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UNINITPINBUTTON1_SW3_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_UNINITPINBUTTON1_SW3_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_UNINITPINBUTTON1_SW3_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinButton1(void);

/*! @name PORTD1 (number 24), Send_LED
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UNINITPINBUTTON0_SW2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_UNINITPINBUTTON0_SW2_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_UNINITPINBUTTON0_SW2_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinButton0(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinSWO(void);

/*! @name PORTB0 (number 46), LED1/LPSPI1_PCS0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UNINITPINLED1_LED1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_UNINITPINLED1_LED1_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_UNINITPINLED1_LED1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinLED1(void);

/*! @name PORTA21 (number 18), pressure Detection
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UNINITPINLED2_LED_R_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_UNINITPINLED2_LED_R_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_UNINITPINLED2_LED_R_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinLED2(void);

/*! @name PORTA19 (number 14), Collection_LED
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UNINITPINLED3_LED_G_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_UNINITPINLED3_LED_G_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_UNINITPINLED3_LED_G_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinLED3(void);

/*! @name PORTA20 (number 17), temp Detection
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UNINITPINLED4_LED_B_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_UNINITPINLED4_LED_B_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_UNINITPINLED4_LED_B_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinLED4(void);

/*! @name PORTB2 (number 48), SCK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITEXTFLASHPINS_SCKSI_IO1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEXTFLASHPINS_SCKSI_IO1_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITEXTFLASHPINS_SCKSI_IO1_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORTB1 (number 47), SI_IO1/SI-IO1/SI-IO1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITEXTFLASHPINS_SI_IO1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEXTFLASHPINS_SI_IO1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITEXTFLASHPINS_SI_IO1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTB3 (number 1), SO_IO1/SO-IO1/SO-IO1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITEXTFLASHPINS_SO_IO1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEXTFLASHPINS_SO_IO1_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITEXTFLASHPINS_SO_IO1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTB0 (number 46), LED1/LPSPI1_PCS0
  @{ */

